"""
3.1数据结构分类
1.逻辑结构：
线性数据结构：数据、链表、栈、队列、哈希表，元素之间一对一的顺序关系
非线性数据结构：树形结构（树、堆、哈希表）、网状结构（图）
2.物理结构：
当算法程序运行时，正在处理的数据主要存储在内存中，系统通过内存地址来访问目标位置的数据
1.连续空间存储---数组---静态数据结构（重新分配内存实现长度变化）
基于数组可实现：栈、队列、哈希表、树、堆、图、矩阵、张量(维度>=3的数组)
2.分散空间存储---链表---动态数据结构（运行过程中对长度进行调整）
基于链表可实现：栈、队列、哈希表、树、堆、图等
"""

"""
3.2基本数据类型
基本数据类型格式CPU可以直接进行运算的类型
整数类型：byte、short、int、long
浮点数类型：float、double
字符类型：char
布尔类型: bool
1byte = 8bit
"""

"""
3.3数字编码
1.原码，补码，反码
原码：我们将数字的二进制表示的最高位视为符号位，其中 表示正数，表示负数，其余位表示数字的值。
反码：正数的反码与其原码相同，负数的反码是对其原码除符号位外的所有位取反。
补码：正数的补码与其原码相同，负数的补码是在其反码的基础上加 。
"""













