#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
@Date: 2024/7/5 0005
@FILE: 树07
@Author: Leo
"""


"""
7.1二叉树
二叉树是一种非线性数据结构，
二叉树的节本单元是节点，每个节点包含值、左子节点引用和又子节点引用

二叉树常用术语：
根节点：位于二叉树顶层的节点，没有父节点
叶节点：没有子节点的节点，其有两个指针均指向None
边：连接两个节点的线段，即节点引用（指针）
节点所在的层：节点的子节点的数量，在二叉树中，度的取值范围是0,1,2
二叉树的高度：从根节点到最远叶节点所经过的边的数量
节点的深度：从根节点到该节点所经过的边的数量
节点的高度：从距离该节点最远的叶节点到该节点经过的边的数量

7.1.1常见二叉树类型
完美二叉树：完美二叉树所有层的节点都被完全填满
完全二叉树：只有最底层的节点未被填满
完满二叉树：除了叶节点之外，其余所有节点都有两个子节点
平衡二叉树：任意节点的左子树和右子树的高度之差的绝对值不超过1

"""


"""
7.2二叉树遍历
7.2.1层序遍历：从顶部到底部逐层遍历二叉树，并在每一层按照从左到右的顺序访问节点

"""

































